{
    "app.header.title":"Jérémy L. Giroux's portfolio",
    "app.home.aboutbefore": "My name is Jérémy Lavallée-Giroux, I am a fullstack developer with  ",
    "app.home.aboutafter": ". You will find my projects below.",
    "app.home.lienprojet": "Projects",
    "app.header.link1": "About",
    "app.header.link2": "First project",
    "app.home.minidesclink2": "Tournament registration website at la Cité",
    "app.header.link3": "Second project",
    "app.home.minidesclink3": "Functional Calculator with C#",
    "app.header.link4": "Third project",
    "app.home.minidesclink4": "Manga store website",
    "app.header.link5": "Contact",
    "app.projet1.title": "Tournaments at La Cité Collégiale",
    "app.projet1.description": "This project consisted of creating a website that allowed a connected user to register for video game tournaments at La Cité. The user can also unsubscribe from a tournament. Those who have administrative rights can see the changes related to registrations, unsubscription, tournament creation and tournament deletion in real time.",
    "app.projet1.inscriptiontitle": "Inscription",
    "app.projet1.inscriptiondesc": "To create an account, the user must enter an email address, a password, as well as his first and last name. Account creation is successful if the user returns to the home page.",
    "app.projet1.connexiontitle": "Connexion",
    "app.projet1.connexiondesc": "To log in to their account, the user goes to the login page at the top right. He then enters his email and the password associated with it in the boxes.",
    "app.projet1.registertitle": "Register for a tournament",
    "app.projet1.registerdesc": "To register for a tournament, the connected user goes to the home page. He can choose which tournament he wishes to register for by pressing the 'Register' button. If registration is successful, the button will be disabled.",
    "app.projet2.title": "C# Calculator",
    "app.projet2.description": "This WPF C# project was to make a simple replica of the Windows Calculator. It allows percentage of written number, division 1/number, exponent 2, square root, division, multiplication, addition and subtraction of two numbers.",
    "app.projet2.addsoustitle": "Addition & Soustraction",
    "app.projet2.addsousdesc": "The user can add or subtract two numbers. The size of the numbers is not a disadvantage.",
    "app.projet2.multdivtitle": "Multiplication & Division",
    "app.projet2.multdivdesc": "The user can multiply or divide two numbers. The size of the numbers is not a disadvantage.",
    "app.projet2.pourctitle": "1/X & Percentage",
    "app.projet2.pourcdesc": "The user can perform a fraction of 1 on the selected number. It can also make the percentage of a number / 100. The size of the numbers is not a disadvantage.",
    "app.projet2.squaretitle": "Square root",
    "app.projet2.squaredesc": "The user can calculate the square root of a number. The size of the numbers is not a disadvantage.",
    "app.projet2.expostitle": "Squared",
    "app.projet2.exposdesc": "The user can calculate number exponent 2 i.e. number X number. The size of the numbers is not a disadvantage.",
    "app.projet3.title": "Manga Shop - ",
    "app.projet3.link": "Link here",
    "app.projet3.description": "This project is to imitate an online manga store. The user can thus create an account and place books in his basket.",
    "app.projet3.findtitle": "Find a book",
    "app.projet3.finddesc": "The user can search for a book by its name, or by collection",
    "app.projet3.addcarttitle": "Add to Cart",
    "app.projet3.addcartdesc": "The user can add a product to his basket and modify its quantity in his basket.",
    "app.projet3.addwishtitle": "Add to wishlist",
    "app.projet3.addwishdesc": "The user can add a product to his wishlist and remove it from it."
}