{
    "app.header.title":"Portfolio Jérémy L. Giroux",
    "app.home.aboutbefore": "Je m'appelle Jérémy Lavallée-Giroux, je suis développeur fullstack avec ",
    "app.home.aboutafter": ". Vous trouverez mes projets vers le bas.",
    "app.home.lienprojet": "Projets",
    "app.header.link1": "À propos",
    "app.header.link2": "Premier projet",
    "app.home.minidesclink2": "Site web d'inscription à des tournois à la Cité",
    "app.header.link3": "Deuxième projet",
    "app.home.minidesclink3": "Calculatrice fonctionnelle avec C#",
    "app.header.link4": "Troisième projet",
    "app.home.minidesclink4": "Site web magasin de manga",
    "app.header.link5": "Contact",
    "app.projet1.title": "Tournois à La Cité Collégiale",
    "app.projet1.description": "Ce projet consistait à créer un site web qui permettait à un utilisateur connecté de s'inscrire à des tournois de jeux vidéo à La Cité. L'utilisateur peut également se désinscrire à un tournoi.Celui qui a les droits administratifs peut voir les changements liés aux inscriptions, désinscription, création de tournoi et suppression de tournois en temps réel.",
    "app.projet1.inscriptiontitle": "Inscription",
    "app.projet1.inscriptiondesc": "Pour se créer un compte, l'utilisateur doit entrer un courriel, un mot de passe, ainsi que son nom et son prénom. La création du compte est un succès si l'utilisateur revient à la page d'accueil.",
    "app.projet1.connexiontitle": "Connexion",
    "app.projet1.connexiondesc": "Pour se connecter à son compte, l'utilisateur se dirige vers la page de connexion en haut à droite. Il entre ensuite dans les cases son courriel ainsi que le mot de passe associé à celui-ci.",
    "app.projet1.registertitle": "S'inscrire à un tournoi",
    "app.projet1.registerdesc": "Pour s'inscrire à un tournoi, l'utilisateur connecté se dirige vers la page d'accueil. Il peut choisir à quel tournoi il souhaite s'inscrire en appuyant sur le bouton 'S'inscrire'. Si l'inscription est effectuée avec succès, le bouton sera désactivé.",
    "app.projet2.title": "Calculatrice C#",
    "app.projet2.description": "Ce projet WPF C# consistait à faire une simple réplique de la calculatrice Windows. Elle permet le pourcentage du nombre écrit, la division 1/le nombre, l'exposant 2, la racine carrée, la division, la multiplication, l'addition et la soustraction de deux nombres.",
    "app.projet2.addsoustitle": "Addition & Soustraction",
    "app.projet2.addsousdesc": "L'utilisateur peut additioner ou soustraire deux nombres. La grosseur des nombres n'est pas un inconvénient.",
    "app.projet2.multdivtitle": "Multiplication & Division",
    "app.projet2.multdivdesc": "L'utilisateur peut multiplier ou diviser deux nombres. La grosseur des nombres n'est pas un inconvénient.",
    "app.projet2.pourctitle": "1/X & Pourcentage",
    "app.projet2.pourcdesc": "L'utilisateur peut effectuer une fraction de 1 sur le nombre sélectionné. Il peut également faire le pourcentage d'un nombre / 100. La grosseur des nombres n'est pas un inconvénient.",
    "app.projet2.squaretitle": "Racine carrée",
    "app.projet2.squaredesc": "L'utilisateur peut calculer la racine carrée d'un nombre. La grosseur des nombres n'est pas un inconvénient.",
    "app.projet2.expostitle": "Exposant 2",
    "app.projet2.exposdesc": "L'utilisateur peut calculer le nombre exposant 2, c'est-à-dire nombre X nombre. La grosseur des nombres n'est pas un inconvénient.",
    "app.projet3.title": "Manga Shop - ",
    "app.projet3.link": "Lien ici",
    "app.projet3.description": "Ce projet consiste à imiter un magasin en ligne de manga. L'utilisateur peut ainsi se créer un compte et placer des livres dans son panier.",
    "app.projet3.findtitle": "Rechercher un livre",
    "app.projet3.finddesc": "L'utilisateur peut rechercher un livre par son nom, ou par collection",
    "app.projet3.addcarttitle": "Ajouter au panier",
    "app.projet3.addcartdesc": "L'utilisateur peut ajouter un produit à son panier et modifier sa quantité dans son panier.",
    "app.projet3.addwishtitle": "Ajouter à la liste de souhait",
    "app.projet3.addwishdesc": "L'utilisateur peut ajouter un produit à sa liste de souhait et le retirer de celle-ci."
}